# Задача 1
# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, 
# стоящих на нечётной позиции.
# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных индексы элементы 3 и 9, ответ: 12

numbers = [2, 3, 5, 9, 3, 7, 1, 6]
sum = 0

for i in range(0, len(numbers)):
    if i % 2 > 0:
        sum += numbers[i]

print(sum)
# ____________________________________________________________________



# Задача 2
# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент,
# второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

# numbers = [2, 3, 4, 5, 6]
# result_num = []
# for i in range((len(numbers)+1)//2):
#     result_num.append(numbers[i]*numbers[len(numbers)-1-i])
# print(result_num)
# ____________________________________________________________________




# Задача 3
# Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу
# между максимальным и минимальным значением дробной части элементов.
# Пример:
# - [1.1, 1.2, 3.1, 10.01] => 0.19

# numbers = [1.1, 1.2, 3.1, 10.01]
# min = 1
# max = 0
# for i in numbers:
#     if (i - int(i)) <= min:
#         min = i - int(i)
#     if (i - int(i)) >= max:
#         max = i - int(i)  
# print(round((max-min), 2))
# ____________________________________________________________________



# Задача 4
# Напишите программу, которая будет преобразовывать десятичное число в двоичное (без встроенных функций).
# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

# a = int(input('Введите число: '))
# b = ''

# while a > 0:
#     b = str(a % 2) + b
#     a = a // 2

# print (b)
# ____________________________________________________________________


# Задача 5
# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# Пример:
# для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21]

# fib1 = fib2 = 1

# fibonacci = [fib1, fib2]
# negative_fibonacci = []

# n = int(input('Введите N: '))
 
# for i in range(2, n):
#     fib1, fib2 = fib2, fib1 + fib2
#     fibonacci.append(fib2)

# for i in fibonacci:
#     negative_fibonacci.append(-i)
#     negative_fibonacci = negative_fibonacci.reverse()

# print (negative_fibonacci)
